//#define  _CRT_SECURE_NO_WARNINGS 1
//#include<stdio.h>
////²Ù×÷·ûµÄÑ§Ï°
////int main()
////{
////	//int x = 16;
//	//int y = 2.0;
//	//x=x << 1;
//	///*ÓÒÒÆ²Ù×÷·û£º
//	//* ËãÊõÓÒÒÆ
//	//* ÓÒ±ß¶ªÆú£¬×ó±ß²¹Ô­·ûºÅÎ»
//	//* Âß¼­ÓÒÒÆ
//	//* ÓÒ±ß¶ªÆú£¬×ó±ß²¹0
//	//*/
////	int a = -1;
////	//´æ´¢µ½ÄÚ´æÖÐµÄÊÇ²¹Âë£¨·´Âë+1£©
////	//-1µÄ²¹ÂëËãÊõÓÒÒÆÒ»Î»£¬·ûºÅÎ»²»±ä
////	//a = a >> 1;
////	//a = a << 1;
////	//×ó±ß¶ªÆú£¬ÓÒ±ß²¹0
////	printf("%d", a);
////	return 0;
////}
//int main()
//{
//	//&
//	//|
//	int a = 3;
//	int b = 5;
//	//int c = a & b;//1
//	//32wei
//	/*int c = a | b;*///7
//	//printf("%d", c);
//	//1
//	//°´Î»Òì»ò
//	//ÏàÍ¬Îª0£¬ÏàÒìÎª1
//	int c = a ^ b;
//	printf("%d", c);//6
//
//	return 0;
//}